## Plan Result (sbox_landing)




<pre><code>Plan: 12 to add, 19 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-Owner-Matt.Lorentzen@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ffb2cb96-d318-48c8-bfd4-b7d8c38743d8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_access_policy.metadata_vault_reders["145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002"] will be created
  + resource "azurerm_key_vault_access_policy" "metadata_vault_reders" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + object_id               = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].azurerm_log_analytics_workspace.this will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
      ~ internet_query_enabled                  = false -> true
        name                                    = "ingest00-logAnalytics001-sbox"
      ~ tags                                    = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (13 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_storage_management_policy.this["landing"] will be updated in-place
  ~ resource "azurerm_storage_management_policy" "this" {
        id                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00landingsbox/managementPolicies/default"
        # (1 unchanged attribute hidden)

      ~ rule {
          ~ name    = "DeleteAfter30Days" -> "default"
            # (1 unchanged attribute hidden)

          ~ actions {
              ~ base_blob {
                  ~ delete_after_days_since_creation_greater_than                  = 30 -> -1
                  ~ tier_to_cool_after_days_since_modification_greater_than        = -1 -> 90
                    # (12 unchanged attributes hidden)
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation_greater_than                  = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation                               = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          ~ filters {
              ~ blob_types   = [
                  - "appendBlob",
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
        name                                                   = "ingest00-legacy-sql-sbox"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
        id                                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox/databases/MetadataControl"
      ~ max_size_gb                                                = 2 -> 1
        name                                                       = "MetadataControl"
      ~ storage_account_type                                       = "Zone" -> "Geo"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox"
        name                                 = "ingest00-metadata-mssql-sbox"
      ~ outbound_network_restriction_enabled = true -> false
      ~ public_network_access_enabled        = true -> false
        tags                                 = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (9 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ login_username              = "DTS DLRM Data Ingestion Admin (env:sandbox)" -> "DTS Platform Operations"
          ~ object_id                   = "145da22b-a3cb-4ba8-b735-22c94b5eea6c" -> "e7ea2042-4ced-45dd-8ae3-e051c6551789"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
      - enable_rbac_authorization       = true -> null
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
        name                            = "ingest00-meta002-sbox"
      ~ public_network_access_enabled   = false -> true
        tags                            = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (11 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Deny" -> "Allow"
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + object_id               = "59bab40b-0894-4faf-9f92-0f627108107a"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-private-sbox"
        name                                           = "ingest00-data-bricks-private-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        name                                           = "ingest00-data-bricks-product-private-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-public-sbox"
        name                                           = "ingest00-data-bricks-product-public-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-public-sbox"
        name                                           = "ingest00-data-bricks-public-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-integration-001-sbox"
        name                                           = "ingest00-data-integration-001-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-integration-002-sbox"
        name                                           = "ingest00-data-integration-002-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
        name                                           = "ingest00-data-product-001-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

      - delegation {
          - name = "delegation" -> null

          - service_delegation {
              - actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                ] -> null
              - name    = "Microsoft.Web/serverFarms" -> null
            }
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-002-sbox"
        name                                           = "ingest00-data-product-002-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-gh-runners"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-gh-runners-sbox"
        name                                           = "ingest00-gh-runners-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
        name                                           = "ingest00-services-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services-mysql"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-mysql-sbox"
        name                                           = "ingest00-services-mysql-sbox"
      ~ service_endpoints                              = [
          - "Microsoft.Storage",
        ]
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["mssql"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-mssql-sbox"
      + subresource_name   = "sqlServer"
      + target_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ default_to_oauth_authentication   = true -> false
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00landingsbox"
        name                              = "ingest00landingsbox"
        tags                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (37 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          ~ delete_retention_policy {
              ~ days = 7 -> 365
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ default_to_oauth_authentication   = true -> false
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
        name                              = "ingest00workspacesbox"
        tags                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (37 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          ~ delete_retention_policy {
              ~ days = 7 -> 365
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 12 to add, 19 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->